#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
google_project_service.enable_compute_api: Refreshing state... [id=dtc-dataops-dev-366316/compute.googleapis.com]
module.nyc_taxi_data_lake.google_storage_bucket.gcp_bucket: Refreshing state... [id=nyc-taxi-dev-dtc-dataops-dev-366316]
google_compute_network.vpc: Refreshing state... [id=projects/dtc-dataops-dev-366316/global/networks/cloud-composer-network-dev]
module.cloud_composer.google_project_service.composer_api: Refreshing state... [id=dtc-dataops-dev-366316/composer.googleapis.com]
module.cloud_composer.google_service_account.cloud_composer_service_account: Refreshing state... [id=projects/dtc-dataops-dev-366316/serviceAccounts/composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_service_account.airflow: Refreshing state... [id=projects/dtc-dataops-dev-366316/serviceAccounts/airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_bigquery_dataset.big_query: Refreshing state... [id=projects/dtc-dataops-dev-366316/datasets/trips_data_all]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/composer.worker"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/composer.worker/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/bigquery.dataEditor"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/iam.serviceAccountUser"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/iam.serviceAccountUser/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/storage.objectAdmin"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_project_iam_member.airflow["roles/bigquery.dataEditor"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
google_project_iam_member.airflow["roles/storage.objectAdmin"]: Refreshing state... [id=dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com]
module.cloud_composer.google_compute_subnetwork.cloud_composer_subnet: Refreshing state... [id=projects/dtc-dataops-dev-366316/regions/us-west1/subnetworks/cloud-composer-subnet-dev]
module.cloud_composer.google_service_account_iam_member.cloud_composer_iam_binding: Refreshing state... [id=projects/dtc-dataops-dev-366316/serviceAccounts/composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com/roles/composer.ServiceAgentV2Ext/serviceAccount:service-523776208646@cloudcomposer-accounts.iam.gserviceaccount.com]
module.cloud_composer.google_composer_environment.cloud_composer: Refreshing state... [id=projects/dtc-dataops-dev-366316/locations/us-west1/environments/dtc-cloud-composer-dev]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # google_project_iam_member.airflow["roles/bigquery.dataEditor"] has changed
  ~ resource "google_project_iam_member" "airflow" {
      ~ etag    = "BwXsmydsB94=" -> "BwXsqw4xY+U="
        id      = "dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # google_project_iam_member.airflow["roles/storage.objectAdmin"] has changed
  ~ resource "google_project_iam_member" "airflow" {
      ~ etag    = "BwXsmydsB94=" -> "BwXsqw4xY+U="
        id      = "dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:airflow-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_composer_environment.cloud_composer has changed
  ~ resource "google_composer_environment" "cloud_composer" {
        id      = "projects/dtc-dataops-dev-366316/locations/us-west1/environments/dtc-cloud-composer-dev"
      + labels  = {}
        name    = "dtc-cloud-composer-dev"
        # (2 unchanged attributes hidden)

      ~ config {
            # (5 unchanged attributes hidden)



          ~ node_config {
              + tags                 = []
                # (7 unchanged attributes hidden)
            }


          ~ software_config {
              + env_variables            = {}
              + pypi_packages            = {}
                # (3 unchanged attributes hidden)
            }


            # (5 unchanged blocks hidden)
        }
    }

  # module.cloud_composer.google_compute_subnetwork.cloud_composer_subnet has changed
  ~ resource "google_compute_subnetwork" "cloud_composer_subnet" {
        id                         = "projects/dtc-dataops-dev-366316/regions/us-west1/subnetworks/cloud-composer-subnet-dev"
        name                       = "cloud-composer-subnet-dev"
      ~ private_ip_google_access   = false -> true
      ~ secondary_ip_range         = [
          + {
              + ip_cidr_range = "10.142.128.0/17"
              + range_name    = "gke-us-west1-dtc-cloud-composer-10fe5001-gke-pods-3ccee8b5"
            },
          + {
              + ip_cidr_range = "10.143.0.0/22"
              + range_name    = "gke-us-west1-dtc-cloud-composer-10fe5001-gke-services-3ccee8b5"
            },
        ]
        # (10 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/bigquery.dataEditor"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmydsB94=" -> "BwXsqw4xY+U="
        id      = "dtc-dataops-dev-366316/roles/bigquery.dataEditor/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/composer.worker"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmydsB94=" -> "BwXsqw4xY+U="
        id      = "dtc-dataops-dev-366316/roles/composer.worker/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/iam.serviceAccountUser"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmydsB94=" -> "BwXsqw4xY+U="
        id      = "dtc-dataops-dev-366316/roles/iam.serviceAccountUser/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_project_iam_member.cloud_composer_iam["roles/storage.objectAdmin"] has changed
  ~ resource "google_project_iam_member" "cloud_composer_iam" {
      ~ etag    = "BwXsmydsB94=" -> "BwXsqw4xY+U="
        id      = "dtc-dataops-dev-366316/roles/storage.objectAdmin/serviceAccount:composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }

  # module.cloud_composer.google_service_account_iam_member.cloud_composer_iam_binding has changed
  ~ resource "google_service_account_iam_member" "cloud_composer_iam_binding" {
      ~ etag               = "BwXsquU4gOk=" -> "BwXsq0PVvEk="
        id                 = "projects/dtc-dataops-dev-366316/serviceAccounts/composer-service-account-dev@dtc-dataops-dev-366316.iam.gserviceaccount.com/roles/composer.ServiceAgentV2Ext/serviceAccount:service-523776208646@cloudcomposer-accounts.iam.gserviceaccount.com"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_service_account.airflow_cicd will be created
  + resource "google_service_account" "airflow_cicd" {
      + account_id   = "airflow-cicd-dev"
      + disabled     = false
      + display_name = "CI / CD Service Account for Airflow Deployments"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = (known after apply)
      + unique_id    = (known after apply)
    }

  # google_storage_bucket_iam_member.airflow_cicd will be created
  + resource "google_storage_bucket_iam_member" "airflow_cicd" {
      + bucket = "us-west1-dtc-cloud-composer-10fe5001-bucket"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = (known after apply)
      + role   = "roles/storage.admin"
    }

  # module.cloud_composer.google_compute_subnetwork.cloud_composer_subnet will be updated in-place
  ~ resource "google_compute_subnetwork" "cloud_composer_subnet" {
        id                         = "projects/dtc-dataops-dev-366316/regions/us-west1/subnetworks/cloud-composer-subnet-dev"
        name                       = "cloud-composer-subnet-dev"
      - private_ip_google_access   = true -> null
        # (11 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @djcurill, Action: `pull_request`*